In [9]:
import pandas as pd
import numpy as np

In [21]:
data = pd.read_excel("Data/sample-salesv3.xlsx")
data.head()

,account number,name,sku,quantity,unit price,ext price,date
0,740150,Barton LLC,B1-20000,39,86.69,3380.91,2014-01-01 07:21:51
1,714466,Trantow-Barrows,S2-77896,-1,63.16,-63.16,2014-01-01 10:00:47
2,218895,Kulas Inc,B1-69924,23,90.70,2086.10,2014-01-01 13:24:58
3,307599,"Kassulke, Ondricka and Metz",S1-65481,41,21.05,863.05,2014-01-01 15:05:22
4,412290,Jerde-Hilpert,S2-34077,6,83.21,499.26,2014-01-01 23:26:55

In [22]:
data.shape

(1500, 7)

In [24]:
data.dtypes.value_counts()

object     3
int64      2
float64    2
dtype: int64

In [25]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   account number  1500 non-null   int64
 1   name            1500 non-null   object
 2   sku             1500 non-null   object
 3   quantity        1500 non-null   int64
 4   unit price      1500 non-null   float64
 5   ext price       1500 non-null   float64
 6   date            1500 non-null   object
dtypes: float64(2), int64(2), object(3)
memory usage: 82.2+ KB

In [29]:
data.describe().T

,count,mean,std,min,25%,50%,75%,max
account number,1500.0,485957.841333,223974.044572,141962.00,257198.0000,527099.000,714466.000,786968.00
quantity,1500.0,24.308667,14.439265,-1.00,12.0000,25.000,37.000,49.00
unit price,1500.0,55.007527,25.903267,10.03,32.5000,55.465,77.075,99.85
ext price,1500.0,1345.856213,1084.914881,-97.16,472.1775,1050.390,2068.330,4824.54

In [30]:
for i in data.columns:
    print(data[i].value_counts())
    print("*"*70)

218895    94
714466    94
412290    89
424914    86
740150    82
729833    82
737550    81
146832    79
383080    74
688981    74
642753    73
672390    73
239344    72
786968    72
527099    71
257198    67
307599    64
141962    62
604255    58
163416    53
Name: account number, dtype: int64
**********************************************************************
Kulas Inc                          94
Trantow-Barrows                    94
Jerde-Hilpert                      89
White-Trantow                      86
Barton LLC                         82
Koepp Ltd                          82
Fritsch, Russel and Anderson       81
Kiehn-Spinka                       79
Will LLC                           74
Keeling LLC                        74
Pollich LLC                        73
Kuhn-Gusikowski                    73
Frami, Hills and Schmidt           72
Stokes LLC                         72
Sanford and Sons                   71
Cronin, Oberbrunner and Spencer    67
Kassulke, Ondricka and Metz        64
Herman LLC                         62
Halvorson, Crona and Champlin      58
Purdy-Kunde                        53
Name: name, dtype: int64
**********************************************************************
S2-77896    73
S1-82801    60
S2-10342    59
S1-47412    58
S1-93683    57
B1-38851    56
S2-82423    56
S1-50961    55
S1-30248    55
B1-20000    53
S1-06532    53
S1-27722    53
B1-53636    53
S2-34077    51
S2-83881    51
B1-53102    49
B1-05914    49
B1-33364    49
S2-16558    49
B1-04202    48
B1-65551    47
S2-78676    46
B1-69924    44
S2-11481    44
B1-33087    44
S2-23246    41
S2-00301    39
B1-50809    39
B1-86481    35
S1-65481    34
Name: sku, dtype: int64
**********************************************************************
 12    47
 6     43
 30    43
 9     39
 13    36
 46    36
 28    36
 10    36
 45    35
 33    34
 44    34
 25    33
 38    33
 35    33
 34    33
 27    32
 3     32
 22    32
 37    32
 23    32
 41    31
 2     31
 43    31
 4     30
 39    30
 19    30
 1     30
 32    29
 26    29
 40    29
 8     28
 20    28
 15    28
-1     28
 24    27
 31    27
 5     26
 49    26
 14    25
 11    25
 18    24
 21    24
 47    24
 17    23
 48    23
 42    23
 16    21
 29    21
 7     19
 36    19
Name: quantity, dtype: int64
**********************************************************************
22.55    3
22.03    3
77.06    3
13.68    2
79.02    2
        ..
68.68    1
25.66    1
52.49    1
79.64    1
33.25    1
Name: unit price, Length: 1392, dtype: int64
**********************************************************************
770.40     2
605.52     2
2044.70    2
51.96      2
1814.40    2
          ..
660.96     1
468.48     1
149.04     1
1834.98    1
266.00     1
Name: ext price, Length: 1491, dtype: int64
**********************************************************************
2014-10-22 02:58:20    1
2014-08-26 07:19:31    1
2014-02-16 04:51:11    1
2014-08-25 23:43:17    1
2014-09-10 14:23:28    1
                      ..
2014-02-12 13:17:28    1
2014-09-23 12:06:27    1
2014-11-06 15:28:29    1
2014-01-01 13:24:58    1
2014-05-06 16:35:28    1
Name: date, Length: 1500, dtype: int64
**********************************************************************

### Summarizing all of the sales by month

In [31]:
data['date'] = pd.to_datetime(data['date'])
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   account number  1500 non-null   int64
 1   name            1500 non-null   object
 2   sku             1500 non-null   object
 3   quantity        1500 non-null   int64
 4   unit price      1500 non-null   float64
 5   ext price       1500 non-null   float64
 6   date            1500 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(2), int64(2), object(2)
memory usage: 82.2+ KB

In [38]:
data.groupby(data['date'].dt.month)["ext price"].sum()

date
1     185361.66
2     146211.62
3     203921.38
4     174574.11
5     165418.55
6     174089.33
7     191662.11
8     153778.59
9     168443.17
10    171495.32
11    119961.22
12    163867.26
Name: ext price, dtype: float64

### Groupby name

`Summarizing all of the sales by month, you could use the resample function. The tricky part about using resample is that it only operates on an index. In this data set, the data is not indexed by the date column so resample would not work without restructuring the data. In order to make it work, use set_index to make the date column an index and then resample:`

In [44]:
data.set_index('date').groupby('name')["ext price"].resample("M").sum()

name        date
Barton LLC  2014-01-31     6177.57
            2014-02-28    12218.03
            2014-03-31     3513.53
            2014-04-30    11474.20
            2014-05-31    10220.17
                            ...
Will LLC    2014-08-31     1439.82
            2014-09-30     4345.99
            2014-10-31     7085.33
            2014-11-30     3210.44
            2014-12-31    12561.21
Name: ext price, Length: 240, dtype: float64

### Groupby syntax - pd.Grouper

In [53]:
data.groupby(['name', pd.Grouper(key = 'date', freq = 'M')])['ext price'].sum()

name        date
Barton LLC  2014-01-31     6177.57
            2014-02-28    12218.03
            2014-03-31     3513.53
            2014-04-30    11474.20
            2014-05-31    10220.17
                            ...
Will LLC    2014-08-31     1439.82
            2014-09-30     4345.99
            2014-10-31     7085.33
            2014-11-30     3210.44
            2014-12-31    12561.21
Name: ext price, Length: 240, dtype: float64

In [58]:
# For June
data.groupby(['name', pd.Grouper(key = 'date', freq = 'A-Jun')])['ext price'].sum()

name                             date
Barton LLC                       2014-06-30    54067.23
                                 2015-06-30    55371.27
Cronin, Oberbrunner and Spencer  2014-06-30    42634.85
                                 2015-06-30    47099.70
Frami, Hills and Schmidt         2014-06-30    41960.55
                                 2015-06-30    61609.04
Fritsch, Russel and Anderson     2014-06-30    58252.12
                                 2015-06-30    53962.59
Halvorson, Crona and Champlin    2014-06-30    38215.18
                                 2015-06-30    31789.18
Herman LLC                       2014-06-30    35416.28
                                 2015-06-30    47448.72
Jerde-Hilpert                    2014-06-30    60502.92
                                 2015-06-30    52088.51
Kassulke, Ondricka and Metz      2014-06-30    37024.01
                                 2015-06-30    49427.06
Keeling LLC                      2014-06-30    58010.33
                                 2015-06-30    42923.97
Kiehn-Spinka                     2014-06-30    47654.30
                                 2015-06-30    51954.47
Koepp Ltd                        2014-06-30    56880.72
                                 2015-06-30    46779.82
Kuhn-Gusikowski                  2014-06-30    44705.82
                                 2015-06-30    46388.46
Kulas Inc                        2014-06-30    83804.92
                                 2015-06-30    53547.04
Pollich LLC                      2014-06-30    39305.72
                                 2015-06-30    48041.46
Purdy-Kunde                      2014-06-30    35660.62
                                 2015-06-30    42237.59
Sanford and Sons                 2014-06-30    56949.74
                                 2015-06-30    41873.24
Stokes LLC                       2014-06-30    59594.15
                                 2015-06-30    31941.77
Trantow-Barrows                  2014-06-30    60411.31
                                 2015-06-30    62970.07
White-Trantow                    2014-06-30    73748.61
                                 2015-06-30    62093.38
Will LLC                         2014-06-30    64777.27
                                 2015-06-30    39660.33
Name: ext price, dtype: float64

### Aggregate function

In [64]:
# normal way returns Series
data[["ext price", "quantity"]].sum()

ext price    2018784.32
quantity       36463.00
dtype: float64

In [65]:
# Using Aggregate Function- returns DataFrame
data[["ext price", "quantity", "unit price"]].agg(['sum', 'mean'])

         ext price      quantity    unit price
sum   2.018784e+06  36463.000000  82511.290000
mean  1.345856e+03     24.308667     55.007527

#### We can pass a dictionary to agg and specify what operations to apply to each column.

In [68]:
data.agg({'ext price' : ['mean', 'sum', 'min', 'max'],
         'quantity' : ['mean',  'max'],
         'unit price' : ['mean', 'max']})

         ext price   quantity  unit price
max   4.824540e+03  49.000000   99.850000
mean  1.345856e+03  24.308667   55.007527
min  -9.716000e+01        NaN         NaN
sum   2.018784e+06        NaN         NaN

#### Use a mode function that works on text.

In [69]:
get_max = lambda x: x.value_counts(dropna=False).index[0]

In [80]:
# naming the function
get_max.__name__ = "most frequent"

In [79]:
data.agg({'ext price' : ['mean', 'sum', 'min', 'max'],
         'quantity' : ['mean',  'max'],
         'unit price' : ['mean', 'max'],
         'sku' : [get_max]})

                  ext price   quantity  unit price       sku
max            4.824540e+03  49.000000   99.850000       NaN
mean           1.345856e+03  24.308667   55.007527       NaN
min           -9.716000e+01        NaN         NaN       NaN
most frequent           NaN        NaN         NaN  S2-77896
sum            2.018784e+06        NaN         NaN       NaN

In [75]:
# Returns mode of the column
data['sku'].value_counts(dropna=False).index[0]

'S2-77896'

In [77]:
data['sku'].mode()[0]

'S2-77896'

`The aggregate function using a dictionary is useful but one challenge is that it does not preserve order. If you want to make sure your columns are in a specific order, you can use an OrderedDict`

In [81]:
import collections
f = collections.OrderedDict([('ext price', ['sum', 'mean']), ('quantity', ['sum', 'mean']), ('sku', [get_max])])
data.agg(f)

                  ext price      quantity       sku
mean           1.345856e+03     24.308667       NaN
most frequent           NaN           NaN  S2-77896
sum            2.018784e+06  36463.000000       NaN